### AWS UAT App plan Part # 1
  #### Terraform Format and Style 🖌`success`
  #### Terraform Initialization ⚙️`success`
  #### Terraform Plan 📖`success`
  <details><summary>Show Plan</summary>
  ```

  [command]/home/runner/work/_temp/e7898dc5-252c-4528-a096-0a90fbdf4151/terraform-bin show -no-color plan.tfplan

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # module.s3_object_uat.aws_s3_bucket_object.this["about.html"] will be updated in-place
  ~ resource "aws_s3_bucket_object" "this" {
        id                     = "about.html"
      ~ source_hash            = "2f76a2c5a447e5afb362e2b3a1f4f967" -> "ff5e64e2dfbfc9438652352f58e4680c"
        tags                   = {
            "Bucket"          = "uat.shortpoet.com"
            "CloudFlare"      = "true"
            "CloudFlare_Zone" = "shortpoet.com"
            "Project"         = "sp"
            "Terraform"       = "true"
        }
      + version_id             = (known after apply)
        # (13 unchanged attributes hidden)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["articles.html"] will be updated in-place
  ~ resource "aws_s3_bucket_object" "this" {
        id                     = "articles.html"
      ~ source_hash            = "f1da0856dab8b2a1a4b90b99b8cf451a" -> "7a03a395fc5da3444f7f05dec1164e82"
        tags                   = {
            "Bucket"          = "uat.shortpoet.com"
            "CloudFlare"      = "true"
            "CloudFlare_Zone" = "shortpoet.com"
            "Project"         = "sp"
            "Terraform"       = "true"
        }
      + version_id             = (known after apply)
        # (13 unchanged attributes hidden)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["articles/learning-to-unit-test-en.html"] will be updated in-place
  ~ resource "aws_s3_bucket_object" "this" {
        id                     = "articles/learning-to-unit-test-en.html"
      ~ source_hash            = "3990edc814d0e69a0724c8946f5428bf" -> "91fe43d64e24a2a102c15cfadc623455"
        tags                   = {
            "Bucket"          = "uat.shortpoet.com"
            "CloudFlare"      = "true"
            "CloudFlare_Zone" = "shortpoet.com"
            "Project"         = "sp"
            "Terraform"       = "true"
        }
      + version_id             = (known after apply)
        # (13 unchanged attributes hidden)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["articles/learning-to-unit-test-es.html"] will be updated in-place
  ~ resource "aws_s3_bucket_object" "this" {
        id                     = "articles/learning-to-unit-test-es.html"
      ~ source_hash            = "a79e302b4b644feb9edbf9e7273d7bc0" -> "9e46af31927eba65f8131f328e3b27b6"
        tags                   = {
            "Bucket"          = "uat.shortpoet.com"
            "CloudFlare"      = "true"
            "CloudFlare_Zone" = "shortpoet.com"
            "Project"         = "sp"
            "Terraform"       = "true"
        }
      + version_id             = (known after apply)
        # (13 unchanged attributes hidden)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/About-1b452a57.js"] will be destroyed
  # (because key ["assets/About-1b452a57.js"] is not in for_each map)
  - resource "aws_s3_bucket_object" "this" {
      - acl                    = "private" -> null
      - bucket                 = "uat.shortpoet.com" -> null
      - bucket_key_enabled     = false -> null
      - cache_control          = "max-age=31536000, immutable" -> null
      - content_type           = "application/javascript" -> null
      - etag                   = "e4851df3428be965f3e0041f772a58c1" -> null
      - force_destroy          = true -> null
      - id                     = "assets/About-1b452a57.js" -> null
      - key                    = "assets/About-1b452a57.js" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./../../../../../app/build/assets/About-1b452a57.js" -> null
      - source_hash            = "e4851df3428be965f3e0041f772a58c1" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {
          - "Bucket"          = "uat.shortpoet.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "shortpoet.com"
          - "Project"         = "sp"
          - "Terraform"       = "true"
        } -> null
      - tags_all               = {
          - "Bucket"          = "uat.shortpoet.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "shortpoet.com"
          - "Project"         = "sp"
          - "Terraform"       = "true"
        } -> null
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/About-f6ed2526.js"] will be created
  + resource "aws_s3_bucket_object" "this" {
      + acl                    = "private"
      + bucket                 = "uat.shortpoet.com"
      + bucket_key_enabled     = (known after apply)
      + cache_control          = "max-age=31536000, immutable"
      + content_type           = "application/javascript"
      + etag                   = (known after apply)
      + force_destroy          = true
      + id                     = (known after apply)
      + key                    = "assets/About-f6ed2526.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../../../../../app/build/assets/About-f6ed2526.js"
      + source_hash            = "9fed6980641ecde2c9aa1a87907d58af"
      + storage_class          = "STANDARD"
      + tags                   = {
          + "Bucket"          = "uat.shortpoet.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "shortpoet.com"
          + "Project"         = "sp"
          + "Terraform"       = "true"
        }
      + tags_all               = {
          + "Bucket"          = "uat.shortpoet.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "shortpoet.com"
          + "Project"         = "sp"
          + "Terraform"       = "true"
        }
      + version_id             = (known after apply)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/ArticleLayouts-35aa4823.js"] will be destroyed
  # (because key ["assets/ArticleLayouts-35aa4823.js"] is not in for_each map)
  - resource "aws_s3_bucket_object" "this" {
      - acl                    = "private" -> null
      - bucket                 = "uat.shortpoet.com" -> null
      - bucket_key_enabled     = false -> null
      - cache_control          = "max-age=31536000, immutable" -> null
      - content_type           = "application/javascript" -> null
      - etag                   = "754d38199b05e677c61987b09ef75088" -> null
      - force_destroy          = true -> null
      - id                     = "assets/ArticleLayouts-35aa4823.js" -> null
      - key                    = "assets/ArticleLayouts-35aa4823.js" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./../../../../../app/build/assets/ArticleLayouts-35aa4823.js" -> null
      - source_hash            = "754d38199b05e677c61987b09ef75088" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {
          - "Bucket"          = "uat.shortpoet.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "shortpoet.com"
          - "Project"         = "sp"
          - "Terraform"       = "true"
        } -> null
      - tags_all               = {
          - "Bucket"          = "uat.shortpoet.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "shortpoet.com"
          - "Project"         = "sp"
          - "Terraform"       = "true"
        } -> null
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/ArticleLayouts-c7af1ddb.js"] will be created
  + resource "aws_s3_bucket_object" "this" {
      + acl                    = "private"
      + bucket                 = "uat.shortpoet.com"
      + bucket_key_enabled     = (known after apply)
      + cache_control          = "max-age=31536000, immutable"
      + content_type           = "application/javascript"
      + etag                   = (known after apply)
      + force_destroy          = true
      + id                     = (known after apply)
      + key                    = "assets/ArticleLayouts-c7af1ddb.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../../../../../app/build/assets/ArticleLayouts-c7af1ddb.js"
      + source_hash            = "f459b103de1dfc090bfc064c2ee30c6c"
      + storage_class          = "STANDARD"
      + tags                   = {
          + "Bucket"          = "uat.shortpoet.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "shortpoet.com"
          + "Project"         = "sp"
          + "Terraform"       = "true"
        }
      + tags_all               = {
          + "Bucket"          = "uat.shortpoet.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "shortpoet.com"
          + "Project"         = "sp"
          + "Terraform"       = "true"
        }
      + version_id             = (known after apply)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/Articles-0d8ebaa8.css"] will be created
  + resource "aws_s3_bucket_object" "this" {
      + acl                    = "private"
      + bucket                 = "uat.shortpoet.com"
      + bucket_key_enabled     = (known after apply)
      + cache_control          = "max-age=31536000, immutable"
      + content_type           = "text/css"
      + etag                   = (known after apply)
      + force_destroy          = true
      + id                     = (known after apply)
      + key                    = "assets/Articles-0d8ebaa8.css"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../../../../../app/build/assets/Articles-0d8ebaa8.css"
      + source_hash            = "33c3c94cc1859add12238311d16f6c1f"
      + storage_class          = "STANDARD"
      + tags                   = {
          + "Bucket"          = "uat.shortpoet.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "shortpoet.com"
          + "Project"         = "sp"
          + "Terraform"       = "true"
        }
      + tags_all               = {
          + "Bucket"          = "uat.shortpoet.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "shortpoet.com"
          + "Project"         = "sp"
          + "Terraform"       = "true"
        }
      + version_id             = (known after apply)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/Articles-285ca014.js"] will be created
  + resource "aws_s3_bucket_object" "this" {
      + acl                    = "private"
      + bucket                 = "uat.shortpoet.com"
      + bucket_key_enabled     = (known after apply)
      + cache_control          = "max-age=31536000, immutable"
      + content_type           = "application/javascript"
      + etag                   = (known after apply)
      + force_destroy          = true
      + id                     = (known after apply)
      + key                    = "assets/Articles-285ca014.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../../../../../app/build/assets/Articles-285ca014.js"
      + source_hash            = "e418b248802d83ac9ad7bc1b2766ca9a"
      + storage_class          = "STANDARD"
      + tags                   = {
          + "Bucket"          = "uat.shortpoet.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "shortpoet.com"
          + "Project"         = "sp"
          + "Terraform"       = "true"
        }
      + tags_all               = {
          + "Bucket"          = "uat.shortpoet.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "shortpoet.com"
          + "Project"         = "sp"
          + "Terraform"       = "true"
        }
      + version_id             = (known after apply)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/Articles-87c7dedf.js"] will be destroyed
  # (because key ["assets/Articles-87c7dedf.js"] is not in for_each map)
  - resource "aws_s3_bucket_object" "this" {
      - acl                    = "private" -> null
      - bucket                 = "uat.shortpoet.com" -> null
      - bucket_key_enabled     = false -> null
      - cache_control          = "max-age=31536000, immutable" -> null
      - content_type           = "application/javascript" -> null
      - etag                   = "4777d4f692d5e4297098bf839c7572b9" -> null
      - force_destroy          = true -> null
      - id                     = "assets/Articles-87c7dedf.js" -> null
      - key                    = "assets/Articles-87c7dedf.js" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./../../../../../app/build/assets/Articles-87c7dedf.js" -> null
      - source_hash            = "4777d4f692d5e4297098bf839c7572b9" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {
          - "Bucket"          = "uat.shortpoet.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "shortpoet.com"
          - "Project"         = "sp"
          - "Terraform"       = "true"
        } -> null
      - tags_all               = {
          - "Bucket"          = "uat.shortpoet.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "shortpoet.com"
          - "Project"         = "sp"
          - "Terraform"       = "true"
        } -> null
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/Articles-cdca7afd.css"] will be destroyed
  # (because key ["assets/Articles-cdca7afd.css"] is not in for_each map)
  - resource "aws_s3_bucket_object" "this" {
      - acl                    = "private" -> null
      - bucket                 = "uat.shortpoet.com" -> null
      - bucket_key_enabled     = false -> null
      - cache_control          = "max-age=31536000, immutable" -> null
      - content_type           = "text/css" -> null
      - etag                   = "d254e9f4850a323e5ea30df3ac31964d" -> null
      - force_destroy          = true -> null
      - id                     = "assets/Articles-cdca7afd.css" -> null
      - key                    = "assets/Articles-cdca7afd.css" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./../../../../../app/build/assets/Articles-cdca7afd.css" -> null
      - source_hash            = "d254e9f4850a323e5ea30df3ac31964d" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {
          - "Bucket"          = "uat.shortpoet.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "shortpoet.com"
          - "Project"         = "sp"
          - "Terraform"       = "true"
        } -> null
      - tags_all               = {
          - "Bucket"          = "uat.shortpoet.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "shortpoet.com"
          - "Project"         = "sp"
          - "Terraform"       = "true"
        } -> null
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/Landing-0f119c3f.js"] will be destroyed
  # (because key ["assets/Landing-0f119c3f.js"] is not in for_each map)
  - resource "aws_s3_bucket_object" "this" {
      - acl                    = "private" -> null
      - bucket                 = "uat.shortpoet.com" -> null
      - bucket_key_enabled     = false -> null
      - cache_control          = "max-age=31536000, immutable" -> null
      - content_type           = "application/javascript" -> null
      - etag                   = "725717ca160855774c9129761f8ed67e" -> null
      - force_destroy          = true -> null
      - id                     = "assets/Landing-0f119c3f.js" -> null
      - key                    = "assets/Landing-0f119c3f.js" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./../../../../../app/build/assets/Landing-0f119c3f.js" -> null
      - source_hash            = "725717ca160855774c9129761f8ed67e" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {
          - "Bucket"          = "uat.shortpoet.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "shortpoet.com"
          - "Project"         = "sp"
          - "Terraform"       = "true"
        } -> null
      - tags_all               = {
          - "Bucket"          = "uat.shortpoet.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "shortpoet.com"
          - "Project"         = "sp"
          - "Terraform"       = "true"
        } -> null
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/Landing-7a6fa8ba.js"] will be created
  + resource "aws_s3_bucket_object" "this" {
      + acl                    = "private"
      + bucket                 = "uat.shortpoet.com"
      + bucket_key_enabled     = (known after apply)
      + cache_control          = "max-age=31536000, immutable"
      + content_type           = "application/javascript"
      + etag                   = (known after apply)
      + force_destroy          = true
      + id                     = (known after apply)
      + key                    = "assets/Landing-7a6fa8ba.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../../../../../app/build/assets/Landing-7a6fa8ba.js"
      + source_hash            = "2f0946094f214b496e10d781d4288ad8"
      + storage_class          = "STANDARD"
      + tags                   = {
          + "Bucket"          = "uat.shortpoet.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "shortpoet.com"
          + "Project"         = "sp"
          + "Terraform"       = "true"
        }
      + tags_all               = {
          + "Bucket"          = "uat.shortpoet.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "shortpoet.com"
          + "Project"         = "sp"
          + "Terraform"       = "true"
        }
      + version_id             = (known after apply)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/PDF-75e2b3b7.js"] will be created
  + resource "aws_s3_bucket_object" "this" {
      + acl                    = "private"
      + bucket                 = "uat.shortpoet.com"
      + bucket_key_enabled     = (known after apply)
      + cache_control          = "max-age=31536000, immutable"
      + content_type           = "application/javascript"
      + etag                   = (known after apply)
      + force_destroy          = true
      + id                     = (known after apply)
      + key                    = "assets/PDF-75e2b3b7.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../../../../../app/build/assets/PDF-75e2b3b7.js"
      + source_hash            = "8e4a043c22d2a5ff7726b6b42588ddc6"
      + storage_class          = "STANDARD"
      + tags                   = {
          + "Bucket"          = "uat.shortpoet.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "shortpoet.com"
          + "Project"         = "sp"
          + "Terraform"       = "true"
        }
      + tags_all               = {
          + "Bucket"          = "uat.shortpoet.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "shortpoet.com"
          + "Project"         = "sp"
          + "Terraform"       = "true"
        }
      + version_id             = (known after apply)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/PDF-79951129.js"] will be destroyed
  # (because key ["assets/PDF-79951129.js"] is not in for_each map)
  - resource "aws_s3_bucket_object" "this" {
      - acl                    = "private" -> null
      - bucket                 = "uat.shortpoet.com" -> null
      - bucket_key_enabled     = false -> null
      - cache_control          = "max-age=31536000, immutable" -> null
      - content_type           = "application/javascript" -> null
      - etag                   = "86ef3f2faf4eda49b52d3584dd6f3c03" -> null
      - force_destroy          = true -> null
      - id                     = "assets/PDF-79951129.js" -> null
      - key                    = "assets/PDF-79951129.js" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./../../../../../app/build/assets/PDF-79951129.js" -> null
      - source_hash            = "86ef3f2faf4eda49b52d3584dd6f3c03" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {
          - "Bucket"          = "uat.shortpoet.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "shortpoet.com"
          - "Project"         = "sp"
          - "Terraform"       = "true"
        } -> null
      - tags_all               = {
          - "Bucket"          = "uat.shortpoet.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "shortpoet.com"
          - "Project"         = "sp"
          - "Terraform"       = "true"
        } -> null
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/PDF-cd6aeca2.css"] will be created
  + resource "aws_s3_bucket_object" "this" {
      + acl                    = "private"
      + bucket                 = "uat.shortpoet.com"
      + bucket_key_enabled     = (known after apply)
      + cache_control          = "max-age=31536000, immutable"
      + content_type           = "text/css"
      + etag                   = (known after apply)
      + force_destroy          = true
      + id                     = (known after apply)
      + key                    = "assets/PDF-cd6aeca2.css"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../../../../../app/build/assets/PDF-cd6aeca2.css"
      + source_hash            = "460980a08fb6a7fb9af48988c5e5cc28"
      + storage_class          = "STANDARD"
      + tags                   = {
          + "Bucket"          = "uat.shortpoet.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "shortpoet.com"
          + "Project"         = "sp"
          + "Terraform"       = "true"
        }
      + tags_all               = {
          + "Bucket"          = "uat.shortpoet.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "shortpoet.com"
          + "Project"         = "sp"
          + "Terraform"       = "true"
        }
      + version_id             = (known after apply)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/PDF-d26b4436.css"] will be destroyed
  # (because key ["assets/PDF-d26b4436.css"] is not in for_each map)
  - resource "aws_s3_bucket_object" "this" {
      - acl                    = "private" -> null
      - bucket                 = "uat.shortpoet.com" -> null
      - bucket_key_enabled     = false -> null
      - cache_control          = "max-age=31536000, immutable" -> null
      - content_type           = "text/css" -> null
      - etag                   = "b30914c960afd765971c03c1acb96ba3" -> null
      - force_destroy          = true -> null
      - id                     = "assets/PDF-d26b4436.css" -> null
      - key                    = "assets/PDF-d26b4436.css" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./../../../../../app/build/assets/PDF-d26b4436.css" -> null
      - source_hash            = "b30914c960afd765971c03c1acb96ba3" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {
          - "Bucket"          = "uat.shortpoet.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "shortpoet.com"
          - "Project"         = "sp"
          - "Terraform"       = "true"
        } -> null
      - tags_all               = {
          - "Bucket"          = "uat.shortpoet.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "shortpoet.com"
          - "Project"         = "sp"
          - "Terraform"       = "true"
        } -> null
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/Start-98b1b8ec.js"] will be destroyed
  # (because key ["assets/Start-98b1b8ec.js"] is not in for_each map)
  - resource "aws_s3_bucket_object" "this" {
      - acl                    = "private" -> null
      - bucket                 = "uat.shortpoet.com" -> null
      - bucket_key_enabled     = false -> null
      - cache_control          = "max-age=31536000, immutable" -> null
      - content_type           = "application/javascript" -> null
      - etag                   = "e1bdfa60d52e69dfb6a44a4298003031" -> null
      - force_destroy          = true -> null
      - id                     = "assets/Start-98b1b8ec.js" -> null
      - key                    = "assets/Start-98b1b8ec.js" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./../../../../../app/build/assets/Start-98b1b8ec.js" -> null
      - source_hash            = "e1bdfa60d52e69dfb6a44a4298003031" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {
          - "Bucket"          = "uat.shortpoet.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "shortpoet.com"
          - "Project"         = "sp"
          - "Terraform"       = "true"
        } -> null
      - tags_all               = {
          - "Bucket"          = "uat.shortpoet.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "shortpoet.com"
          - "Project"         = "sp"
          - "Terraform"       = "true"
        } -> null
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/Start-d99439a3.js"] will be created
  + resource "aws_s3_bucket_object" "this" {
      + acl                    = "private"
      + bucket                 = "uat.shortpoet.com"
      + bucket_key_enabled     = (known after apply)
      + cache_control          = "max-age=31536000, immutable"
      + content_type           = "application/javascript"
      + etag                   = (known after apply)
      + force_destroy          = true
      + id                     = (known after apply)
      + key                    = "assets/Start-d99439a3.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../../../../../app/build/assets/Start-d99439a3.js"
      + source_hash            = "73da5c5170264b0a7679572f66c1e979"
      + storage_class          = "STANDARD"
      + tags                   = {
          + "Bucket"          = "uat.shortpoet.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "shortpoet.com"
          + "Project"         = "sp"
          + "Terraform"       = "true"
        }
      + tags_all               = {
          + "Bucket"          = "uat.shortpoet.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "shortpoet.com"
          + "Project"         = "sp"
          + "Terraform"       = "true"
        }
      + version_id             = (known after apply)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/StartNav-8d8b46cd.js"] will be created
  + resource "aws_s3_bucket_object" "this" {
      + acl                    = "private"
      + bucket                 = "uat.shortpoet.com"
      + bucket_key_enabled     = (known after apply)
      + cache_control          = "max-age=31536000, immutable"
      + content_type           = "application/javascript"
      + etag                   = (known after apply)
      + force_destroy          = true
      + id                     = (known after apply)
      + key                    = "assets/StartNav-8d8b46cd.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../../../../../app/build/assets/StartNav-8d8b46cd.js"
      + source_hash            = "b1ce5d0b6fc7352905246fb357ab35d2"
      + storage_class          = "STANDARD"
      + tags                   = {
          + "Bucket"          = "uat.shortpoet.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "shortpoet.com"
          + "Project"         = "sp"
          + "Terraform"       = "true"
        }
      + tags_all               = {
          + "Bucket"          = "uat.shortpoet.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "shortpoet.com"
          + "Project"         = "sp"
          + "Terraform"       = "true"
        }
      + version_id             = (known after apply)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/StartNav-8e766fdc.js"] will be destroyed
  # (because key ["assets/StartNav-8e766fdc.js"] is not in for_each map)
  - resource "aws_s3_bucket_object" "this" {
      - acl                    = "private" -> null
      - bucket                 = "uat.shortpoet.com" -> null
      - bucket_key_enabled     = false -> null
      - cache_control          = "max-age=31536000, immutable" -> null
      - content_type           = "application/javascript" -> null
      - etag                   = "ace1f40ca3f08bfb9b56f5f697912144" -> null
      - force_destroy          = true -> null
      - id                     = "assets/StartNav-8e766fdc.js" -> null
      - key                    = "assets/StartNav-8e766fdc.js" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./../../../../../app/build/assets/StartNav-8e766fdc.js" -> null
      - source_hash            = "ace1f40ca3f08bfb9b56f5f697912144" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {
          - "Bucket"          = "uat.shortpoet.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "shortpoet.com"
          - "Project"         = "sp"
          - "Terraform"       = "true"
        } -> null
      - tags_all               = {
          - "Bucket"          = "uat.shortpoet.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "shortpoet.com"
          - "Project"         = "sp"
          - "Terraform"       = "true"
        } -> null
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/app-6f19e6c3.js"] will be created
  + resource "aws_s3_bucket_object" "this" {
      + acl                    = "private"
      + bucket                 = "uat.shortpoet.com"
      + bucket_key_enabled     = (known after apply)
      + cache_control          = "max-age=31536000, immutable"
      + content_type           = "application/javascript"
      + etag                   = (known after apply)
      + force_destroy          = true
      + id                     = (known after apply)
      + key                    = "assets/app-6f19e6c3.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../../../../../app/build/assets/app-6f19e6c3.js"
      + source_hash            = "09c57d259ee48aab7e0235280a8819f1"
      + storage_class          = "STANDARD"
      + tags                   = {
          + "Bucket"          = "uat.shortpoet.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "shortpoet.com"
          + "Project"         = "sp"
          + "Terraform"       = "true"
        }
      + tags_all               = {
          + "Bucket"          = "uat.shortpoet.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "shortpoet.com"
          + "Project"         = "sp"
          + "Terraform"       = "true"
        }
      + version_id             = (known after apply)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/app-db3615a1.js"] will be destroyed
  # (because key ["assets/app-db3615a1.js"] is not in for_each map)
  - resource "aws_s3_bucket_object" "this" {
      - acl                    = "private" -> null
      - bucket                 = "uat.shortpoet.com" -> null
      - bucket_key_enabled     = false -> null
      - cache_control          = "max-age=31536000, immutable" -> null
      - content_type           = "application/javascript" -> null
      - etag                   = "65f6fb758440aff9f33912a15988713f" -> null
      - force_destroy          = true -> null
      - id                     = "assets/app-db3615a1.js" -> null
      - key                    = "assets/app-db3615a1.js" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./../../../../../app/build/assets/app-db3615a1.js" -> null
      - source_hash            = "65f6fb758440aff9f33912a15988713f" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {
          - "Bucket"          = "uat.shortpoet.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "shortpoet.com"
          - "Project"         = "sp"
          - "Terraform"       = "true"
        } -> null
      - tags_all               = {
          - "Bucket"          = "uat.shortpoet.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "shortpoet.com"
          - "Project"         = "sp"
          - "Terraform"       = "true"
        } -> null
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/bootstrap-2f49b383.css"] will be created
  + resource "aws_s3_bucket_object" "this" {
      + acl                    = "private"
      + bucket                 = "uat.shortpoet.com"
      + bucket_key_enabled     = (known after apply)
      + cache_control          = "max-age=31536000, immutable"
      + content_type           = "text/css"
      + etag                   = (known after apply)
      + force_destroy          = true
      + id                     = (known after apply)
      + key                    = "assets/bootstrap-2f49b383.css"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../../../../../app/build/assets/bootstrap-2f49b383.css"
      + source_hash            = "452e3c0684a0657a691145f0fb7e4da8"
      + storage_class          = "STANDARD"
      + tags                   = {
          + "Bucket"          = "uat.shortpoet.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "shortpoet.com"
          + "Project"         = "sp"
          + "Terraform"       = "true"
        }
      + tags_all               = {
          + "Bucket"          = "uat.shortpoet.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "shortpoet.com"
          + "Project"         = "sp"
          + "Terraform"       = "true"
        }
      + version_id             = (known after apply)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/bootstrap-37892e52.css"] will be destroyed
  # (because key ["assets/bootstrap-37892e52.css"] is not in for_each map)
  - resource "aws_s3_bucket_object" "this" {
      - acl                    = "private" -> null
      - bucket                 = "uat.shortpoet.com" -> null
      - bucket_key_enabled     = false -> null
      - cache_control          = "max-age=31536000, immutable" -> null
      - content_type           = "text/css" -> null
      - etag                   = "4a26c11f667087bbb5a2242c131951aa" -> null
      - force_destroy          = true -> null
      - id                     = "assets/bootstrap-37892e52.css" -> null
      - key                    = "assets/bootstrap-37892e52.css" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./../../../../../app/build/assets/bootstrap-37892e52.css" -> null
      - source_hash            = "4a26c11f667087bbb5a2242c131951aa" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {
          - "Bucket"          = "uat.shortpoet.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "shortpoet.com"
          - "Project"         = "sp"
          - "Terraform"       = "true"
        } -> null
      - tags_all               = {
          - "Bucket"          = "uat.shortpoet.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "shortpoet.com"
          - "Project"         = "sp"
          - "Terraform"       = "true"
        } -> null
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/bootstrap.esm-5ea4a862.js"] will be created
  + resource "aws_s3_bucket_object" "this" {
      + acl                    = "private"
      + bucket                 = "uat.shortpoet.com"
      + bucket_key_enabled     = (known after apply)
      + cache_control          = "max-age=31536000, immutable"
      + content_type           = "application/javascript"
      + etag                   = (known after apply)
      + force_destroy          = true
      + id                     = (known after apply)
      + key                    = "assets/bootstrap.esm-5ea4a862.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../../../../../app/build/assets/bootstrap.esm-5ea4a862.js"
      + source_hash            = "39b7d6a0e8ea05a02d17e1cda0bae126"
      + storage_class          = "STANDARD"
      + tags                   = {
          + "Bucket"          = "uat.shortpoet.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "shortpoet.com"
          + "Project"         = "sp"
          + "Terraform"       = "true"
        }
      + tags_all               = {
          + "Bucket"          = "uat.shortpoet.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "shortpoet.com"
          + "Project"         = "sp"
          + "Terraform"       = "true"
        }
      + version_id             = (known after apply)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/bootstrap.esm-695d0ac0.js"] will be destroyed
  # (because key ["assets/bootstrap.esm-695d0ac0.js"] is not in for_each map)
  - resource "aws_s3_bucket_object" "this" {
      - acl                    = "private" -> null
      - bucket                 = "uat.shortpoet.com" -> null
      - bucket_key_enabled     = false -> null
      - cache_control          = "max-age=31536000, immutable" -> null
      - content_type           = "application/javascript" -> null
      - etag                   = "c4c932c880d8de73e782d1e5464dc273" -> null
      - force_destroy          = true -> null
      - id                     = "assets/bootstrap.esm-695d0ac0.js" -> null
      - key                    = "assets/bootstrap.esm-695d0ac0.js" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./../../../../../app/build/assets/bootstrap.esm-695d0ac0.js" -> null
      - source_hash            = "c4c932c880d8de73e782d1e5464dc273" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {
          - "Bucket"          = "uat.shortpoet.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "shortpoet.com"
          - "Project"         = "sp"
          - "Terraform"       = "true"
        } -> null
      - tags_all               = {
          - "Bucket"          = "uat.shortpoet.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "shortpoet.com"
          - "Project"         = "sp"
          - "Terraform"       = "true"
        } -> null
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/html2canvas.esm-0a33ed42.js"] will be destroyed
  # (because key ["assets/html2canvas.esm-0a33ed42.js"] is not in for_each map)
  - resource "aws_s3_bucket_object" "this" {
      - acl                    = "private" -> null
      - bucket                 = "uat.shortpoet.com" -> null
      - bucket_key_enabled     = false -> null
      - cache_control          = "max-age=31536000, immutable" -> null
      - content_type           = "application/javascript" -> null
      - etag                   = "955bf9b222a46a0897ad2d52916463de" -> null
      - force_destroy          = true -> null
      - id                     = "assets/html2canvas.esm-0a33ed42.js" -> null
      - key                    = "assets/html2canvas.esm-0a33ed42.js" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./../../../../../app/build/assets/html2canvas.esm-0a33ed42.js" -> null
      - source_hash            = "955bf9b222a46a0897ad2d52916463de" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {
          - "Bucket"          = "uat.shortpoet.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "shortpoet.com"
          - "Project"         = "sp"
          - "Terraform"       = "true"
        } -> null
      - tags_all               = {
          - "Bucket"          = "uat.shortpoet.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "shortpoet.com"
          - "Project"         = "sp"
          - "Terraform"       = "true"
        } -> null
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/html2canvas.esm-e0a7d97b.js"] will be created
  + resource "aws_s3_bucket_object" "this" {
      + acl                    = "private"
      + bucket                 = "uat.shortpoet.com"
      + bucket_key_enabled     = (known after apply)
      + cache_control          = "max-age=31536000, immutable"
      + content_type           = "application/javascript"
      + etag                   = (known after apply)
      + force_destroy          = true
      + id                     = (known after apply)
      + key                    = "assets/html2canvas.esm-e0a7d97b.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../../../../../app/build/assets/html2canvas.esm-e0a7d97b.js"
      + source_hash            = "19a537a06ac69a98e5b51f60bf50f92f"
      + storage_class          = "STANDARD"
      + tags                   = {
          + "Bucket"          = "uat.shortpoet.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "shortpoet.com"
          + "Project"         = "sp"
          + "Terraform"       = "true"
        }
      + tags_all               = {
          + "Bucket"          = "uat.shortpoet.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "shortpoet.com"
          + "Project"         = "sp"
          + "Terraform"       = "true"
        }
      + version_id             = (known after apply)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/index-1cb490d5.css"] will be created
  + resource "aws_s3_bucket_object" "this" {
      + acl                    = "private"
      + bucket                 = "uat.shortpoet.com"
      + bucket_key_enabled     = (known after apply)
      + cache_control          = "max-age=31536000, immutable"
      + content_type           = "text/css"
      + etag                   = (known after apply)
      + force_destroy          = true
      + id                     = (known after apply)
      + key                    = "assets/index-1cb490d5.css"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../../../../../app/build/assets/index-1cb490d5.css"
      + source_hash            = "f3b3742a10ca3e3bc76add45dcc7d52b"
      + storage_class          = "STANDARD"
      + tags                   = {
          + "Bucket"          = "uat.shortpoet.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "shortpoet.com"
          + "Project"         = "sp"
          + "Terraform"       = "true"
        }
      + tags_all               = {
          + "Bucket"          = "uat.shortpoet.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "shortpoet.com"
          + "Project"         = "sp"
          + "Terraform"       = "true"
        }
      + version_id             = (known after apply)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/index-2883df99.css"] will be destroyed
  # (because key ["assets/index-2883df99.css"] is not in for_each map)
  - resource "aws_s3_bucket_object" "this" {
      - acl                    = "private" -> null
      - bucket                 = "uat.shortpoet.com" -> null
      - bucket_key_enabled     = false -> null
      - cache_control          = "max-age=31536000, immutable" -> null
      - content_type           = "text/css" -> null
      - etag                   = "4936e3453a7e6bff7c1db8961e8c9697" -> null
      - force_destroy          = true -> null
      - id                     = "assets/index-2883df99.css" -> null
      - key                    = "assets/index-2883df99.css" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./../../../../../app/build/assets/index-2883df99.css" -> null
      - source_hash            = "4936e3453a7e6bff7c1db8961e8c9697" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {
          - "Bucket"          = "uat.shortpoet.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "shortpoet.com"
          - "Project"         = "sp"
          - "Terraform"       = "true"
        } -> null
      - tags_all               = {
          - "Bucket"          = "uat.shortpoet.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "shortpoet.com"
          - "Project"         = "sp"
          - "Terraform"       = "true"
        } -> null
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/index.es-0f76a016.js"] will be created
  + resource "aws_s3_bucket_object" "this" {
      + acl                    = "private"
      + bucket                 = "uat.shortpoet.com"
      + bucket_key_enabled     = (known after apply)
      + cache_control          = "max-age=31536000, immutable"
      + content_type           = "application/javascript"
      + etag                   = (known after apply)
      + force_destroy          = true
      + id                     = (known after apply)
      + key                    = "assets/index.es-0f76a016.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../../../../../app/build/assets/index.es-0f76a016.js"
      + source_hash            = "a83450a9926d9e43484902c5d1d8c745"
      + storage_class          = "STANDARD"
      + tags                   = {
          + "Bucket"          = "uat.shortpoet.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "shortpoet.com"
          + "Project"         = "sp"
          + "Terraform"       = "true"
        }
      + tags_all               = {
          + "Bucket"          = "uat.shortpoet.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "shortpoet.com"
          + "Project"         = "sp"
          + "Terraform"       = "true"
        }
      + version_id             = (known after apply)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/index.es-f23aafa8.js"] will be destroyed
  # (because key ["assets/index.es-f23aafa8.js"] is not in for_each map)
  - resource "aws_s3_bucket_object" "this" {
      - acl                    = "private" -> null
      - bucket                 = "uat.shortpoet.com" -> null
      - bucket_key_enabled     = false -> null
      - cache_control          = "max-age=31536000, immutable" -> null
      - content_type           = "application/javascript" -> null
      - etag                   = "de4ed646a2f6d212d2858e6187c588b8" -> null
      - force_destroy          = true -> null
      - id                     = "assets/index.es-f23aafa8.js" -> null
      - key                    = "assets/index.es-f23aafa8.js" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./../../../../../app/build/assets/index.es-f23aafa8.js" -> null
      - source_hash            = "de4ed646a2f6d212d2858e6187c588b8" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {
          - "Bucket"          = "uat.shortpoet.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "shortpoet.com"
          - "Project"         = "sp"
          - "Terraform"       = "true"
        } -> null
      - tags_all               = {
          - "Bucket"          = "uat.shortpoet.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "shortpoet.com"
          - "Project"         = "sp"
          - "Terraform"       = "true"
        } -> null
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/jquery.easing-688c0ff1.js"] will be destroyed
  # (because key ["assets/jquery.easing-688c0ff1.js"] is not in for_each map)
  - resource "aws_s3_bucket_object" "this" {
      - acl                    = "private" -> null
      - bucket                 = "uat.shortpoet.com" -> null
      - bucket_key_enabled     = false -> null
      - cache_control          = "max-age=31536000, immutable" -> null
      - content_type           = "application/javascript" -> null
      - etag                   = "f2545514c0d11a8c0adaa3d366695f6b" -> null
      - force_destroy          = true -> null
      - id                     = "assets/jquery.easing-688c0ff1.js" -> null
      - key                    = "assets/jquery.easing-688c0ff1.js" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./../../../../../app/build/assets/jquery.easing-688c0ff1.js" -> null
      - source_hash            = "f2545514c0d11a8c0adaa3d366695f6b" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {
          - "Bucket"          = "uat.shortpoet.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "shortpoet.com"
          - "Project"         = "sp"
          - "Terraform"       = "true"
        } -> null
      - tags_all               = {
          - "Bucket"          = "uat.shortpoet.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "shortpoet.com"
          - "Project"         = "sp"
          - "Terraform"       = "true"
        } -> null
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/jquery.easing-93c65839.js"] will be created
  + resource "aws_s3_bucket_object" "this" {
      + acl                    = "private"
      + bucket                 = "uat.shortpoet.com"
      + bucket_key_enabled     = (known after apply)
      + cache_control          = "max-age=31536000, immutable"
      + content_type           = "application/javascript"
      + etag                   = (known after apply)
      + force_destroy          = true
      + id                     = (known after apply)
      + key                    = "assets/jquery.easing-93c65839.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../../../../../app/build/assets/jquery.easing-93c65839.js"
      + source_hash            = "e812f5b1147b9292cbf8155ea33f7bc8"
      + storage_class          = "STANDARD"
      + tags                   = {
          + "Bucket"          = "uat.shortpoet.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "shortpoet.com"
          + "Project"         = "sp"
          + "Terraform"       = "true"
        }
      + tags_all               = {
          + "Bucket"          = "uat.shortpoet.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "shortpoet.com"
          + "Project"         = "sp"
          + "Terraform"       = "true"
        }
      + version_id             = (known after apply)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/purify.es-3ef59d4c.js"] will be destroyed
  # (because key ["assets/purify.es-3ef59d4c.js"] is not in for_each map)
  - resource "aws_s3_bucket_object" "this" {
      - acl                    = "private" -> null
      - bucket                 = "uat.shortpoet.com" -> null
      - bucket_key_enabled     = false -> null
      - cache_control          = "max-age=31536000, immutable" -> null
      - content_type           = "application/javascript" -> null
      - etag                   = "f17593fbd13b830e8b0da63f75b8f242" -> null
      - force_destroy          = true -> null
      - id                     = "assets/purify.es-3ef59d4c.js" -> null
      - key                    = "assets/purify.es-3ef59d4c.js" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./../../../../../app/build/assets/purify.es-3ef59d4c.js" -> null
      - source_hash            = "f17593fbd13b830e8b0da63f75b8f242" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {
          - "Bucket"          = "uat.shortpoet.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "shortpoet.com"
          - "Project"         = "sp"
          - "Terraform"       = "true"
        } -> null
      - tags_all               = {
          - "Bucket"          = "uat.shortpoet.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "shortpoet.com"
          - "Project"         = "sp"
          - "Terraform"       = "true"
        } -> null
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/purify.es-f47f2ec0.js"] will be created
  + resource "aws_s3_bucket_object" "this" {
      + acl                    = "private"
      + bucket                 = "uat.shortpoet.com"
      + bucket_key_enabled     = (known after apply)
      + cache_control          = "max-age=31536000, immutable"
      + content_type           = "application/javascript"
      + etag                   = (known after apply)
      + force_destroy          = true
      + id                     = (known after apply)
      + key                    = "assets/purify.es-f47f2ec0.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../../../../../app/build/assets/purify.es-f47f2ec0.js"
      + source_hash            = "78cfbb6e8ee5339d33996b52efa1a754"
      + storage_class          = "STANDARD"
      + tags                   = {
          + "Bucket"          = "uat.shortpoet.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "shortpoet.com"
          + "Project"         = "sp"
          + "Terraform"       = "true"
        }
      + tags_all               = {
          + "Bucket"          = "uat.shortpoet.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "shortpoet.com"
          + "Project"         = "sp"
          + "Terraform"       = "true"
        }
      + version_id             = (known after apply)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["index.html"] will be updated in-place
  ~ resource "aws_s3_bucket_object" "this" {
        id                     = "index.html"
      ~ source_hash            = "0069fcea5dcfd7570bee775835cc2aa4" -> "f8ec633b0e9412f2f6c181285e963b66"
        tags                   = {
            "Bucket"          = "uat.shortpoet.com"
            "CloudFlare"      = "true"
            "CloudFlare_Zone" = "shortpoet.com"
            "Project"         = "sp"
            "Terraform"       = "true"
        }
      + version_id             = (known after apply)
        # (13 unchanged attributes hidden)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["pdf.html"] will be updated in-place
  ~ resource "aws_s3_bucket_object" "this" {
        id                     = "pdf.html"
      ~ source_hash            = "1f1119c9191eb177bb2e6523a9e79e11" -> "7c83c436f0f732b61bbc343f04c1b555"
        tags                   = {
            "Bucket"          = "uat.shortpoet.com"
            "CloudFlare"      = "true"
            "CloudFlare_Zone" = "shortpoet.com"
            "Project"         = "sp"
            "Terraform"       = "true"
        }
      + version_id             = (known after apply)
        # (13 unchanged attributes hidden)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["resume.html"] will be updated in-place
  ~ resource "aws_s3_bucket_object" "this" {
        id                     = "resume.html"
      ~ source_hash            = "89cadf8ff37982fc9790b9dec1c4e8a0" -> "afcd56250910184a0918821495474cbf"
        tags                   = {
            "Bucket"          = "uat.shortpoet.com"
            "CloudFlare"      = "true"
            "CloudFlare_Zone" = "shortpoet.com"
            "Project"         = "sp"
            "Terraform"       = "true"
        }
      + version_id             = (known after apply)
        # (13 unchanged attributes hidden)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["sitemap.xml"] will be updated in-place
  ~ resource "aws_s3_bucket_object" "this" {
        id                     = "sitemap.xml"
      ~ source_hash            = "d66fabf9b99f8fef685c5c9a3f6eb79b" -> "5810baed62dcf094681ef62cda111012"
        tags                   = {
            "Bucket"          = "uat.shortpoet.com"
            "CloudFlare"      = "true"
            "CloudFlare_Zone" = "shortpoet.com"
            "Project"         = "sp"
            "Terraform"       = "true"
        }
      + version_id             = (known after apply)
        # (13 unchanged attributes hidden)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["ssr-manifest.json"] will be updated in-place
  ~ resource "aws_s3_bucket_object" "this" {
        id                     = "ssr-manifest.json"
      ~ source_hash            = "c52d26cdb57b1d60ecfea66b99da8fdb" -> "8b6a661b10bffe4245516ada3bc08524"
        tags                   = {
            "Bucket"          = "uat.shortpoet.com"
            "CloudFlare"      = "true"
            "CloudFlare_Zone" = "shortpoet.com"
            "Project"         = "sp"
            "Terraform"       = "true"
        }
      + version_id             = (known after apply)
        # (13 unchanged attributes hidden)
    }

Plan: 17 to add, 9 to change, 17 to destroy.

Changes to Outputs:
  ~ s3_bucket_object_etags       = [
        # (4 unchanged elements hidden)
        "a79e302b4b644feb9edbf9e7273d7bc0",
      - "e4851df3428be965f3e0041f772a58c1",
      - "754d38199b05e677c61987b09ef75088",
      - "4777d4f692d5e4297098bf839c7572b9",
      - "d254e9f4850a323e5ea30df3ac31964d",
      - "725717ca160855774c9129761f8ed67e",
      + (known after apply),
      + (known after apply),
      + (known after apply),
      + (known after apply),
      + (known after apply),
        "8c544421623ccc444b2ebb24e21604c6",
      - "86ef3f2faf4eda49b52d3584dd6f3c03",
      - "b30914c960afd765971c03c1acb96ba3",
      - "e1bdfa60d52e69dfb6a44a4298003031",
      - "ace1f40ca3f08bfb9b56f5f697912144",
      + (known after apply),
      + (known after apply),
      + (known after apply),
      + (known after apply),
        "35bc2af385e37e6def98966cb8b61301",
      - "65f6fb758440aff9f33912a15988713f",
      + (known after apply),
        "e60911495dba8bb96def57539a94e9cf",
        "302f026f7e053d0ccf4b0ed827f15900",
      - "4a26c11f667087bbb5a2242c131951aa",
      - "c4c932c880d8de73e782d1e5464dc273",
      + (known after apply),
      + (known after apply),
        "89db6545390762231d3913a3cd717cf3",
        # (10 unchanged elements hidden)
        "ec3072955d336eac324f92874795358e",
      - "955bf9b222a46a0897ad2d52916463de",
      - "4936e3453a7e6bff7c1db8961e8c9697",
      - "de4ed646a2f6d212d2858e6187c588b8",
      - "f2545514c0d11a8c0adaa3d366695f6b",
      + (known after apply),
      + (known after apply),
      + (known after apply),
      + (known after apply),
        "3af47f89e61fe763b909c1fabc4c4083",
      - "f17593fbd13b830e8b0da63f75b8f242",
      + (known after apply),
        "b42fa60cb28ab38ad51179e8b40ff867",
        # (16 unchanged elements hidden)
    ]
  ~ s3_bucket_object_ids         = [
        # (4 unchanged elements hidden)
        "articles/learning-to-unit-test-es.html",
      - "assets/About-1b452a57.js",
      - "assets/ArticleLayouts-35aa4823.js",
      - "assets/Articles-87c7dedf.js",
      - "assets/Articles-cdca7afd.css",
      - "assets/Landing-0f119c3f.js",
      + (known after apply),
      + (known after apply),
      + (known after apply),
      + (known after apply),
      + (known after apply),
        "assets/Landing-a96b032e.css",
      - "assets/PDF-79951129.js",
      - "assets/PDF-d26b4436.css",
      - "assets/Start-98b1b8ec.js",
      - "assets/StartNav-8e766fdc.js",
      + (known after apply),
      + (known after apply),
      + (known after apply),
      + (known after apply),
        "assets/StartNav-cb1e6734.css",
      - "assets/app-db3615a1.js",
      + (known after apply),
        "assets/azure_devicon_forest_green-ee780a3a.svg",
        "assets/bash_devicon_forest_green-ab536553.svg",
      - "assets/bootstrap-37892e52.css",
      - "assets/bootstrap.esm-695d0ac0.js",
      + (known after apply),
      + (known after apply),
        "assets/d3_devicon_forest_green-b8696bec.svg",
        # (10 unchanged elements hidden)
        "assets/github_profile_pic-e8fc6c1b.js",
      - "assets/html2canvas.esm-0a33ed42.js",
      - "assets/index-2883df99.css",
      - "assets/index.es-f23aafa8.js",
      - "assets/jquery.easing-688c0ff1.js",
      + (known after apply),
      + (known after apply),
      + (known after apply),
      + (known after apply),
        "assets/powershell_devicon_forest_green-f06a1fda.svg",
      - "assets/purify.es-3ef59d4c.js",
      + (known after apply),
        "assets/tableau_logo-ec7acb2d.svg",
        # (16 unchanged elements hidden)
    ]
  ~ s3_bucket_object_keys_ids    = [
        # (4 unchanged elements hidden)
        {
            id  = "articles/learning-to-unit-test-es.html"
            key = "articles/learning-to-unit-test-es.html"
        },
      ~ {
          ~ id  = "assets/About-1b452a57.js" -> (known after apply)
          ~ key = "assets/About-1b452a57.js" -> "assets/About-f6ed2526.js"
        },
      ~ {
          ~ id  = "assets/ArticleLayouts-35aa4823.js" -> (known after apply)
          ~ key = "assets/ArticleLayouts-35aa4823.js" -> "assets/ArticleLayouts-c7af1ddb.js"
        },
      ~ {
          ~ id  = "assets/Articles-87c7dedf.js" -> (known after apply)
          ~ key = "assets/Articles-87c7dedf.js" -> "assets/Articles-0d8ebaa8.css"
        },
      ~ {
          ~ id  = "assets/Articles-cdca7afd.css" -> (known after apply)
          ~ key = "assets/Articles-cdca7afd.css" -> "assets/Articles-285ca014.js"
        },
      ~ {
          ~ id  = "assets/Landing-0f119c3f.js" -> (known after apply)
          ~ key = "assets/Landing-0f119c3f.js" -> "assets/Landing-7a6fa8ba.js"
        },
        {
            id  = "assets/Landing-a96b032e.css"
            key = "assets/Landing-a96b032e.css"
        },
      ~ {
          ~ id  = "assets/PDF-79951129.js" -> (known after apply)
          ~ key = "assets/PDF-79951129.js" -> "assets/PDF-75e2b3b7.js"
        },
      ~ {
          ~ id  = "assets/PDF-d26b4436.css" -> (known after apply)
          ~ key = "assets/PDF-d26b4436.css" -> "assets/PDF-cd6aeca2.css"
        },
      ~ {
          ~ id  = "assets/Start-98b1b8ec.js" -> (known after apply)
          ~ key = "assets/Start-98b1b8ec.js" -> "assets/Start-d99439a3.js"
        },
      ~ {
          ~ id  = "assets/StartNav-8e766fdc.js" -> (known after apply)
          ~ key = "assets/StartNav-8e766fdc.js" -> "assets/StartNav-8d8b46cd.js"
        },
        {
            id  = "assets/StartNav-cb1e6734.css"
            key = "assets/StartNav-cb1e6734.css"
        },
      ~ {
          ~ id  = "assets/app-db3615a1.js" -> (known after apply)
          ~ key = "assets/app-db3615a1.js" -> "assets
  ```
  </details>
  *Pusher: @shortpoet, Action: `pull_request`, Working Directory: ``, Workflow: `App Infra`*